BUTTONS = {
    "ru": {
        "deposit": "💳 Пополнить",
        "withdraw": "📤 Вывести",
        "verify": "🔐 Верификация",
        "settings": "⚙️ Настройки",
        "actives": "📂 Мои активы",
        "bankcard": "💳 Пополнить через банковскую карту",
        "crypto": "💱 Пополнить криптовалютой",
        "promocode": "🎁 Ввести промокод",
        "terms": "📖 Условия",
        "certificate": "📜 Сертификат",
        "docs": "📚 Документация",
        "garancy": "Гарантия сервиса",
        "network": "📈 Состояние сети",
        "referal": "⚙️ Реферальная система",
        "website": "🌐 Наш веб сайт",
        "currency": "🌐 Валюта 🌐",
        "language": "🇷🇺 Язык 🇺🇸",
        "back": "🔙",
        "buy": "Покупка",
        "sell": "Продажа",
        "help": "Написать"
    },
    "eng": {
        "deposit": "💳 Deposit",
        "withdraw": "📤 Withdraw",
        "verify": "🔐 Verification",
        "settings": "⚙️ Settings",
        "actives": "📂 My Assets",
        "bankcard": "💳 Deposit via Bank Card",
        "crypto": "💱 Deposit Crypto",
        "promocode": "🎁 Enter Promo Code",
        "terms": "📖 Terms",
        "certificate": "📜 Certificate",
        "docs": "📚 Documentation",
        "garancy": "Service Guarantee",
        "network": "📈 Network Status",
        "referal": "⚙️ Referral System",
        "website": "🌐 Our Website",
        "currency": "🌐 Currency 🌐",
        "language": "🇬🇧 Language 🇷🇺",
        "back": "🔙",
        "buy": "Buy",
        "sell": "Sell",
        "help": "Write"
    }
}

TEXTS = {
    "ru": {
         "about": (
            "<i><b>NIX TRADE — ваш надёжный мост в мир криптовалютной торговли и фьючерсных контрактов.</b>\n\n"
            "<blockquote>Мы — современная централизованная биржа, объединяющая передовые технологии и удобство "
            "использования для трейдеров любого уровня.</blockquote>\n\n"
            "<b>Наши ключевые преимущества:</b>\n\n"
            "<b>Технологическое лидерство</b> — мы постоянно совершенствуем платформу, внедряя инновационные решения и задавая новые "
            "стандарты в индустрии криптовалют. Наша команда следит за последними тенденциями и адаптирует их для "
            "максимального удобства пользователей.\n\n"
            "<b>Клиентоориентированность</b> — каждый трейдер важен для нас. Мы создаём условия, при которых любой пользователь, "
            "независимо от опыта, может стать успешным участником рынка.\n\n"
            "<b>Профессиональная поддержка и качественный сервис</b> — основа наших отношений с клиентами.\n\n"
            "<b>Доступность и простота</b> — торговля криптовалютами и фьючерсами теперь доступна каждому. Интуитивно "
            "понятный интерфейс позволяет быстро освоиться даже новичкам, а продвинутые инструменты открывают широкие "
            "возможности для опытных трейдеров.\n\n"
            "<b>Почему NIX TRADE — ваш идеальный выбор:</b>\n\n"
            "<blockquote>"
            "• Мгновенное исполнение сделок\n"
            "• Надежная защита активов\n"
            "• Широкий выбор торговых инструментов\n"
            "• Круглосуточная поддержка\n"
            "• Прозрачные условия торговли"
            "</blockquote>\n\n"
            "Независимо от вашего опыта и целей, NIX TRADE предоставляет всё необходимое для успешной торговли. "
            "Начните свой путь к финансовому успеху прямо сейчас!\n\n"
            "Присоединяйтесь к динамично развивающейся платформе, где технологии встречаются с удобством, а возможности не "
            "знают границ.</i>"
        ),
        "actives": (
            "<b>🔶 Активы - это финансовые инструменты, которые "
            "трейдеры покупают или продают на рынке для получения прибыли.</b>\n\n"
            "🗄 Активы:\n"
            "┏ BTC: 0.0\n"
            "┣ ETH: 0.0\n"
            "┣ USDT: 0.0\n"
            "┣ SHIB: 0.0\n"
            "┗ ATOM: 0.0"
        ),
        "profile": (
            "💼 Личный кабинет:\n\n"
            "🔐 Верификация: ❌\n"
            "🆔 ID: {user_id}\n"
            "💰 Баланс: {balance}$\n\n"
            "📊 Статистика пользователя:\n"
            "├ Всего сделок: 0\n"
            "├ Неудачных: 0\n"
            "├ Удачных: 0\n"
            "└ Выводов: 0 на сумму 0$\n\n"
            "<b>Добро пожаловать в мир криптовалют NIX TRADE. \n\n"
            "NIX — ваш надёжный партнёр в онлайн-трейдинге на финансовых рынках. 💸</b>"
        ),
        "buy": (
            "<blockquote>ℹ️ Покупка актива по текущей рыночной цене на момент сделки. "
            "На финансовых рынках спот-сделки обычно проводятся на валютных и товарных рынках. "
            "При покупке спота трейдер получает актив сразу и может распоряжаться им по своему усмотрению.</blockquote>\n\n"
            "<b>Популярные монеты для спот-трейдинга с низкими комиссиями:</b>"
        ),
        "options": (
            "<blockquote>Опционы — это финансовые инструменты, предоставляющие инвестору право, но не обязанность, "
            "купить или продать определённое количество акций или других активов по заранее установленной цене "
            "в конкретный момент в будущем.</blockquote>\n\n"
            "<b>🔶 Выберите монету для инвестирования средств:</b>"
        ),
        "sell": (
            "<blockquote>ℹ️ Продажа актива по текущей рыночной цене на момент сделки. "
            "На финансовых рынках спот-сделки обычно проводятся на валютных и товарных рынках. "
            "При продаже спота трейдер получает деньги за актив по текущей цене.</blockquote>\n\n"
            "<b>Популярные монеты для спот-продаж с низкими комиссиями:</b>"
        ),
        "welcome": (
            "<b>Добро пожаловать в NIX!</b>\n\n"
            "<blockquote>Ваш путь к финансовой свободе начинается здесь. </blockquote>\n\n"
            "<blockquote>NIX Trading Platform — это современная торговая платформа, созданная для "
            "трейдеров любого уровня подготовки. Мы объединили "
            "передовые технологии, безопасность и удобство "
            "использования в одном месте.</blockquote>\n\n"
            "<b>Почему выбирают нас:</b>\n\n"
            "<i>Мгновенные сделки с минимальной комиссией.</i>\n\n"
            "<i>Надежная защита ваших средств и данных.</i>\n\n"
            "<i>Интуитивный интерфейс для комфортной торговли.</i>\n\n"
            "<i>Аналитика в реальном времени для принятия взвешенных решений.</i>\n\n"
            "<i>Поддержка 24/7 для решения любых вопросов.</i>\n\n"
            "<b>Начните прямо сейчас:</b>\n\n"
            "<i>Зарегистрируйтесь -></i>\n"
            "<i>Пополните счет удобным способом -></i>\n"
            "<i>Выберите стратегию и начните торговать!</i>\n\n"
            "<b>Важно: Торговля финансовыми инструментами сопряжена с "
            "рисками. Пожалуйста, ознакомьтесь с условиями"
            "использования и рисками перед началом торговли.\n\n"
            "Желаем успешных сделок и прибыльных стратегий!</b>\n\n"
            "<blockquote>Команда NixDev ❤️</blockquote>"
        ),
        "help": (
            "📘 Вы можете открыть заявку в службу "
            "поддержки NIX TRADE. Специалист ответит Вам в "
            "ближайшие сроки.\n"
            "Для более быстрого решения проблемы "
            "описывайте возникшую проблему "
            "максимально четко. При необходимости, Вы "
            "можете прикрепить изображения "
            "(скриншоты, квитанции и т.д.)\n\n"
            "<b>Правила обращения в тех. поддержку:</b>\n\n"
            "1. Пожалуйста, представьтесь при первом "
            "обращении.\n"
            "2. Описывайте проблему своими словами, но "
            "как можно подробнее.\n"
            "3. Если возможно, прикрепите скриншот, на "
            "котором видно, в чём заключается Ваша "
            "проблема.\n"
            "4. Пришлите Ваш ID личного кабинета, дабы "
            "ускорить решение проблемы.\n"
            "5. Относитесь к агенту поддержки с "
            "уважением. Не грубите ему и не дерзите, "
            "если заинтересованы в скорейшем разрешении "
            "Вашего вопроса."
        )
    },
    "eng": {
         "about": (
            "NIX TRADE is a centralized exchange for trading "
            "cryptocurrencies and futures assets.\n\n"
            "🔹 Leading Innovation\n"
            " ┗ We are constantly striving for excellence. "
            "Implementing advanced solutions and setting new trends "
            "makes us industry leaders.\n\n"
            "🔹 Customer Loyalty\n"
            " ┗ Accessible opportunities for everyone to become "
            "a professional trader. Building long-term relationships "
            "through responsiveness and top-notch service.\n\n"
            "🔹 Shared Success\n"
            " ┗ Our goal is to provide clients worldwide with "
            "simple and accessible trading that allows them to earn "
            "on financial markets anytime and anywhere.\n\n"
            "With a simple user interface, NIX TRADE is ideal for "
            "beginners. The platform is easy to navigate, attracting "
            "both advanced and new traders and investors."
        ),
        "actives": (
            "Assets are financial instruments that traders buy or sell on the market to make a profit.\n\n"
            "🗄 Assets:\n"
            "┏ BTC: 0.0\n"
            "┣ ETH: 0.0\n"
            "┣ USDT: 0.0\n"
            "┣ SHIB: 0.0\n"
            "┗ ATOM: 0.0"
        ),
        "profile": (
            "💼 Personal Account:\n\n"
            "🔐 Verification: ❌\n"
            "🆔 ID: {user_id}\n"
            "💰 Balance: 0₽\n\n"
            "📊 User Statistics:\n"
            "├ Total trades: 0\n"
            "├ Unsuccessful: 0\n"
            "├ Successful: 0\n"
            "└ Withdrawals: 0 totaling 0₽\n\n"
            "Step into the world of cryptocurrencies with NIX TRADE – "
            "your trusted companion for online trading in financial markets."
        ),
        "buy": (
            "ℹ️ Buying an asset at the current market price at the time of the trade. "
            "On financial markets, spot trades are typically executed on currency and commodity markets. "
            "When buying spot, the trader receives the asset immediately and can manage it freely.\n\n"
            "Popular coins for spot trading with low fees:"
        ),
        "options": (
            "Options are financial instruments that give the investor the right, but not the obligation, "
            "to buy or sell a certain amount of stocks or other assets at a predetermined price "
            "at a specific point in the future.\n\n"
            "💠 Choose a coin to invest your funds:"
        ),
        "sell": (
            "ℹ️ Selling an asset at the current market price at the time of the trade. "
            "On financial markets, spot trades are typically executed on currency and commodity markets. "
            "When selling spot, the trader receives cash for the asset at the current market price.\n\n"
            "Popular coins for spot trading with low fees:"
        ),
        "welcome": (
            "<b>Welcome to NIX!</b>\n\n"
            "<blockquote>Your path to financial freedom starts here.</blockquote>"
            ),
        "help": (
            "📘 Вы можете открыть заявку в службу "
            "поддержки NIX TRADE. Специалист ответит Вам в "
            "ближайшие сроки.\n"
            "Для более быстрого решения проблемы "
            "описывайте возникшую проблему "
            "максимально четко. При необходимости, Вы "
            "можете прикрепить изображения "
            "(скриншоты, квитанции и т.д.)\n\n"
            "<b>Правила обращения в тех. поддержку:</b>\n\n"
            "1. Пожалуйста, представьтесь при первом "
            "обращении.\n"
            "2. Описывайте проблему своими словами, но "
            "как можно подробнее.\n"
            "3. Если возможно, прикрепите скриншот, на "
            "котором видно, в чём заключается Ваша "
            "проблема.\n"
            "4. Пришлите Ваш ID личного кабинета, дабы "
            "ускорить решение проблемы.\n"
            "5. Относитесь к агенту поддержки с "
            "уважением. Не грубите ему и не дерзите, "
            "если заинтересованы в скорейшем разрешении "
            "Вашего вопроса."
        )
    }
}
